# Setup

In [1]:
install.packages("dplyr")

package 'dplyr' successfully unpacked and MD5 sums checked

Warning message:
"cannot remove prior installation of package 'dplyr'"
Warning message in file.copy(savedcopy, lib, recursive = TRUE):
"problem copying C:\Users\bex\anaconda3\envs\articles\Lib\R\library\00LOCK\dplyr\libs\x64\dplyr.dll to C:\Users\bex\anaconda3\envs\articles\Lib\R\library\dplyr\libs\x64\dplyr.dll: Permission denied"
Warning message:
"restored 'dplyr'"

The downloaded binary packages are in
	C:\Users\bex\AppData\Local\Temp\RtmpuC2pNV\downloaded_packages

In [2]:
library(dplyr)

Attaching package: 'dplyr'


The following objects are masked from 'package:stats':

    filter, lag


The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [3]:
library(tidyverse)

-- Attaching packages --------------------------------------- tidyverse 1.3.1 --

v ggplot2 3.3.6     v purrr   0.3.4
v tibble  3.1.7     v stringr 1.4.0
v tidyr   1.2.0     v forcats 0.5.1
v readr   2.1.2

-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

In [4]:
airbnb_listings <- read_csv("data/listings.csv")

Rows: 3 Columns: 5
-- Column specification --------------------------------------------------------
Delimiter: ","
chr (2): city, country
dbl (3): listing_id, number_of_rooms, year_listed

i Use `spec()` to retrieve the full column specification for this data.
i Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [5]:
host_listings = read_csv("data/host.csv")

Rows: 3 Columns: 4
-- Column specification --------------------------------------------------------
Delimiter: ","
chr (1): name
dbl (3): host_id, listing_id, number_of_reviews

i Use `spec()` to retrieve the full column specification for this data.
i Specify the column types or set `show_col_types = FALSE` to quiet this message.

# Transforming data with dplyr

## Working with columns

#### Instructions: Please provide at least 5 functions covering working with columns

- select() 
- rename()

##### 1. select column(s)

In [6]:
airbnb_listings %>%
    select(listing_id, city)

  listing_id city
1 1          Paris
2 2          Tokyo
3 3          New York

##### 2. Reorder columns

In [7]:
airbnb_listings %>%
    select(city, country, everything())

  city     country listing_id number_of_rooms year_listed
1 Paris    France  1          5               2018
2 Tokyo    Japan   2          2               2017
3 New York USA     3          2               2022

In [11]:
airbnb_listings %>%
    rename(year=year_listed)

  listing_id city     country number_of_rooms year
1 1          Paris    France  5               2018
2 2          Tokyo    Japan   2               2017
3 3          New York USA     2               2022

##### 3. Select based on start/end characters:

In [12]:
select(airbnb_listings, starts_with("c"))

  city     country
1 Paris    France
2 Tokyo    Japan
3 New York USA

In [13]:
select(airbnb_listings, ends_with("s"))

  number_of_rooms
1 5
2 2
3 2

##### 4. Select based on a regular expression

In [17]:
select(airbnb_listings, matches("(.n.)|(n.)"))

  listing_id country number_of_rooms
1 1          France  5
2 2          Japan   2
3 3          USA     2

##### 5. Include/Exclude certain columns

In [21]:
# Everything but listing_id
select(airbnb_listings, -listing_id)

  city     country number_of_rooms year_listed
1 Paris    France  5               2018
2 Tokyo    Japan   2               2017
3 New York USA     2               2022

In [20]:
# A column range
select(airbnb_listings, country:year_listed)

  country number_of_rooms year_listed
1 France  5               2018
2 Japan   2               2017
3 USA     2               2022

## Working with rows

#### Instructions: Please provide at least 5-7 functions covering working with rows

- filter() on one condition
- filter() on two conditions
- arrange() descending
- arrange() ascending 
- distinct()
- slice()

##### 1. Filter on one condition

In [23]:
airbnb_listings %>%
    filter(country=="France")

  listing_id city  country number_of_rooms year_listed
1 1          Paris France  5               2018

##### 2. Filter on two condition

In [28]:
airbnb_listings %>%
    filter(country=="France" | is.na(year_listed))

  listing_id city  country number_of_rooms year_listed
1 1          Paris France  5               2018

##### 5. Sort the table with `arrange()`

In [31]:
# Ascending order
airbnb_listings %>%
    arrange(number_of_rooms)

  listing_id city     country number_of_rooms year_listed
1 2          Tokyo    Japan   2               2017
2 3          New York USA     2               2022
3 1          Paris    France  5               2018

In [33]:
# Descending order (alphabetical)
airbnb_listings %>%
    arrange(desc(city))

  listing_id city     country number_of_rooms year_listed
1 2          Tokyo    Japan   2               2017
2 1          Paris    France  5               2018
3 3          New York USA     2               2022

##### 6. %in% operator with `filter`

In [38]:
airbnb_listings %>%
    filter(country %in% c("Japan", "France"))

  listing_id city  country number_of_rooms year_listed
1 1          Paris France  5               2018
2 2          Tokyo Japan   2               2017

##### 7. Remove duplicate rows with `distinct`

In [39]:
distinct(airbnb_listings)

  listing_id city     country number_of_rooms year_listed
1 1          Paris    France  5               2018
2 2          Tokyo    Japan   2               2017
3 3          New York USA     2               2022

##### 8. Filter rows based on location

In [40]:
slice(airbnb_listings, 1:3)

  listing_id city     country number_of_rooms year_listed
1 1          Paris    France  5               2018
2 2          Tokyo    Japan   2               2017
3 3          New York USA     2               2022

##### 9. Randomly select rows

In [41]:
sample_n(airbnb_listings, 2)

  listing_id city     country number_of_rooms year_listed
1 3          New York USA     2               2022
2 1          Paris    France  5               2018

In [42]:
sample_frac(airbnb_listings, 0.33)

  listing_id city  country number_of_rooms year_listed
1 1          Paris France  5               2018

##### 10. Select rows based on top-n values of a column:

In [44]:
top_n(airbnb_listings, 1, number_of_rooms)

  listing_id city  country number_of_rooms year_listed
1 1          Paris France  5               2018

## Adding new columns

#### Instructions: Please provide at least 5 functions on creating new columns 

- mutate() 
- transmute()
- add_count()

##### 1. Create new cols with mutate

In [52]:
# Returns all columns
airbnb_listings %>%
    mutate(age = 2022 - year_listed)

  listing_id city     country number_of_rooms year_listed age
1 1          Paris    France  5               2018        4
2 2          Tokyo    Japan   2               2017        5
3 3          New York USA     2               2022        0

##### 2. Create a new column using more than one existing column

In [51]:
# Returns only the created column
airbnb_listings %>%
    transmute(city_country = paste(city, country))

  city_country
1 Paris France
2 Tokyo Japan
3 New York USA

##### 3. Count the number of values in groups and only return the count:

In [63]:
airbnb_listings %>% count(city)

  city     n
1 New York 1
2 Paris    1
3 Tokyo    1

In [64]:
airbnb_listings %>% count(city, country)

  city     country n
1 New York USA     1
2 Paris    France  1
3 Tokyo    Japan   1

##### 4. `add_count` group by some column and add the number of rows in each group back to the table

In [53]:
add_count(airbnb_listings, listing_id)

  listing_id city     country number_of_rooms year_listed n
1 1          Paris    France  5               2018        1
2 2          Tokyo    Japan   2               2017        1
3 3          New York USA     2               2022        1

# Aggregating data with dplyr

#### Instructions: Please provide examples of use-cases that leverage these functions. Try to be simplistic and provide one-use-case per function:

- count(, sort=)
- summarize() using sum
- summarize() using mean
- summarize() using sum and mean
- group_by()
- group_by() and summarize() together
- group_by() and summarize() and ungroup() together
- group_by() and top_n()

##### 1. Count groups in a variable and return sorted:

In [66]:
airbnb_listings %>% count(listing_id, sort=TRUE)

  listing_id n
1 1          1
2 2          1
3 3          1

##### 2. Find total number of rooms of all houses:

In [67]:
airbnb_listings %>% summarise(total_rooms=sum(number_of_rooms))

  total_rooms
1 9

##### 3. Find the average number of rooms of houses:

In [68]:
airbnb_listings %>% summarise(avg_room=mean(number_of_rooms))

  avg_room
1 3

##### 5. Find the average age of houses:

In [79]:
airbnb_listings %>%
    summarise(total_years=sum(year_listed)) %>%
    summarise(avg=mean(total_years))

  avg
1 6057

# Joining tables with dplyr

## Working with tables

#### Instructions: Please provide at least 5  functions covering joining different tables at once

- bind_cols()
- bind_rows()

## Joins in dplyr

#### Instructions: Provide examples for these functions:

- inner_join()
- semi_join()
- nest_join()
- left_join()
- right_join()
- full_join()
- anti_join()

In [84]:
airbnb_listings %>% 
    inner_join(host_listings, by='listing_id')

  listing_id city     country number_of_rooms year_listed host_id
1 1          Paris    France  5               2018        1
2 2          Tokyo    Japan   2               2017        2
3 3          New York USA     2               2022        3
  name               number_of_reviews
1 Jen Bricker        34
2 Richie Cotton      12
3 Raven Todd Dasliva 55

In [86]:
host_listings %>%
    semi_join(airbnb_listings, by="listing_id")

  host_id name               listing_id number_of_reviews
1 1       Jen Bricker        1          34
2 2       Richie Cotton      2          12
3 3       Raven Todd Dasliva 3          55

In [87]:
airbnb_listings %>%
    nest_join(host_listings, by="listing_id")

  listing_id city     country number_of_rooms year_listed
1 1          Paris    France  5               2018
2 2          Tokyo    Japan   2               2017
3 3          New York USA     2               2022
  host_listings
1 1          , Jen Bricker, 34
2 2            , Richie Cotton, 12
3 3                 , Raven Todd Dasliva, 55

In [88]:
host_listings %>% left_join(airbnb_listings, by="listing_id")

  host_id name               listing_id number_of_reviews city     country
1 1       Jen Bricker        1          34                Paris    France
2 2       Richie Cotton      2          12                Tokyo    Japan
3 3       Raven Todd Dasliva 3          55                New York USA
  number_of_rooms year_listed
1 5               2018
2 2               2017
3 2               2022

In [90]:
host_listings %>% right_join(airbnb_listings, by="listing_id")

  host_id name               listing_id number_of_reviews city     country
1 1       Jen Bricker        1          34                Paris    France
2 2       Richie Cotton      2          12                Tokyo    Japan
3 3       Raven Todd Dasliva 3          55                New York USA
  number_of_rooms year_listed
1 5               2018
2 2               2017
3 2               2022

In [91]:
host_listings %>% full_join(airbnb_listings, by="listing_id")

  host_id name               listing_id number_of_reviews city     country
1 1       Jen Bricker        1          34                Paris    France
2 2       Richie Cotton      2          12                Tokyo    Japan
3 3       Raven Todd Dasliva 3          55                New York USA
  number_of_rooms year_listed
1 5               2018
2 2               2017
3 2               2022

In [92]:
airbnb_listings %>% anti_join(host_listings, by="listing_id")

     listing_id city country number_of_rooms year_listed